tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

brew "libressl"
brew "gpg"
brew "pinentry-mac"
brew "monkeysphere"
brew "paperkey"
brew "starship"
brew "openjdk@11"
brew "nvm"

# 系统工具
cask "appcleaner"
cask "input-source-pro"
cask "hammerspoon"
cask "snipaste"
cask "raycast"
cask "keka"
cask "keepassxc"
cask "bitwarden"
cask "google-chrome"

# 开发工具
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono"
cask "jetbrains-toolbox"
cask "visual-studio-code"
cask "dbngin"
cask "dbeaver-community"
cask "redisinsight"


# brew "supervisor"
# cask "multipass"

# 开发工具
# cask "tableplus"
# cask "sequel-ace"
# cask "another-redis-desktop-manager"

