# https://github.com/Homebrew/homebrew-bundle

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

brew "libressl"
brew "gpg"
brew "pinentry-mac"
brew "openjdk@11"
brew "node@18", link: true
brew "ipinfo-cli"

# 系统工具
cask "warp"
cask "appcleaner"
cask "input-source-pro"
cask "syntax-highlight"
cask "hammerspoon"
cask "snipaste"
cask "raycast"
cask "keka"
cask "keepassxc"
cask "bitwarden"


# 开发工具
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono"
cask "jetbrains-toolbox"
cask "visual-studio-code"
cask "dbngin"
cask "tableplus"
cask "sequel-ace"
cask "another-redis-desktop-manager"

# brew "starship"
# cask "tabby"
# brew "nvm"
# brew "monkeysphere"
# brew "paperkey"
# brew "supervisor"
# cask "dbeaver-community"
# cask "gpg-suite"
# cask "google-chrome"
# cask "multipass"
# cask "tableplus"
# cask "sequel-ace"
# cask "redisinsight"
