tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

brew "libressl"
brew "gpg"
brew "pinentry-mac"
brew "monkeysphere"
brew "paperkey"
brew "starship"

# 系统工具
cask "appcleaner"
cask "snipaste"
cask "raycast"
cask "keepassxc"
cask "keka"


# 开发工具
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono"
cask "jetbrains-toolbox"
cask "visual-studio-code"
cask "dbngin"
cask "tableplus"
cask "sequel-ace"

# brew "supervisor"
# brew "openjdk@11"
# cask "google-chrome"
# cask "multipass"
# cask "hammerspoon"
